isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
/*
 * bl_proto.c — frame parse/build helpers + dispatch + opcode handlers.
 *
 * Owns the software side of the protocol plumbing:
 *
 *   - addressed-to-us check (defence in depth behind the FDCAN filters)
 *   - a single in-flight ISO-TP reassembly via bl_isotp
 *   - TX helpers for ACK / NACK / FC, all wrapped in ISO-TP framing
 *   - the reassembly timeout tick
 *   - opcode handlers for the Phase 2 set:
 *       CONNECT / DISCONNECT / DISCOVER          — identity & session
 *       FLASH_ERASE / FLASH_WRITE /
 *       FLASH_READ_CRC / FLASH_VERIFY            — programming (via bl_flash)
 *       RESET / JUMP                              — hand-off
 *   - a session-active latch, set by CONNECT and cleared by DISCONNECT.
 *     FLASH_* opcodes refuse to run without it; the remaining opcodes
 *     are session-agnostic so a host can always reach them.
 *
 * HAL dependencies are confined to this file and bl_flash; bl_isotp is
 * HAL-free.
 */

#include "bl_proto.h"

#include "bl_config.h"
#include "bl_dtc.h"
#include "bl_flash.h"
#include "bl_fwinfo.h"
#include "bl_health.h"
#include "bl_isotp.h"
#include "bl_live.h"
#include "bl_log.h"
#include "bl_memmap.h"
#include "main.h"
#include "stm32h7xx_hal.h"

#include <string.h>

extern FDCAN_HandleTypeDef hfdcan2;

/* ---- State ---- */

static bl_isotp_rx_t g_rx;

/* Session latch. Set by CONNECT, cleared by DISCONNECT, by an MCU
 * reset, or by the session watchdog. FLASH_* opcodes require this to
 * be true. */
static bool g_session_active = false;

/* Session watchdog. The last-activity timestamp is updated on two
 * kinds of event:
 *
 *   - every addressed frame that passes the FDCAN filter + TYPE/PCI
 *     check (bl_proto_dispatch), so host-side retries and even
 *     rejected commands count as "still alive"
 *   - every ACK we transmit (send_ack), so a multi-second blocking
 *     handler like FLASH_ERASE re-arms the watchdog once it finally
 *     ACKs. Without this, any operation longer than
 *     BL_SESSION_TIMEOUT_MS would trip the watchdog on the very next
 *     main-loop iteration.
 *
 * The value is only consulted while g_session_active; idle bootloaders
 * are not watchdogged. */
static uint32_t g_session_last_activity_ms = 0U;

static void session_touch_activity(void)
{
    g_session_last_activity_ms = HAL_GetTick();
}

static void session_timeout(void)
{
    /* Record the event before tearing the session down — bl_dtc_log
     * reads the current session state (via bl_health_flags) so the
     * timeline in the health record and any NOTIFY_DTC carries the
     * right "was in session" semantics. */
    bl_dtc_log(BL_DTC_SESSION_TIMEOUT, BL_DTC_SEV_WARN, 0U);
    bl_log_warn("session timeout, tearing down");

    g_session_active = false;
    bl_isotp_rx_init(&g_rx);

    /* Host abandoned us. If a valid application is installed, hand
     * control over; otherwise stay in listen mode for a future
     * reconnect. No NACK is emitted — silence matches what the host
     * has been doing. */
    if (Bootloader_CheckApplication() == 0U) {
        Bootloader_JumpToApplication();
    }
}

/* ---- Low-level TX plumbing ---- */

bool bl_proto_addressed_to_us(uint8_t dst)
{
    return (dst == BL_NODE_ID) || (dst == BL_PROTO_NODE_BROADCAST);
}

/* Map a 0..8 byte count onto the FDCAN_DLC_BYTES_N encoding. */
static uint32_t dlc_bytes_to_fdcan(uint8_t bytes)
{
    uint32_t n = (bytes > 8U) ? 8U : (uint32_t)bytes;
    return n << 16;
}

/* Send one raw CAN frame. The 11-bit ID is built from (type, BL_NODE_ID,
 * dst); `data` holds `length` valid bytes. Any TX-queue full condition
 * is swallowed silently — the host's session timeout is the backstop. */
static void send_raw(uint8_t type,
                     uint8_t dst,
                     const uint8_t *data,
                     uint8_t length)
{
    FDCAN_TxHeaderTypeDef tx = { 0 };
    tx.Identifier          = bl_proto_build_id((bl_proto_type_t)type,
                                               BL_NODE_ID,
                                               dst);
    tx.IdType              = FDCAN_STANDARD_ID;
    tx.TxFrameType         = FDCAN_DATA_FRAME;
    tx.DataLength          = dlc_bytes_to_fdcan(length);
    tx.ErrorStateIndicator = FDCAN_ESI_ACTIVE;
    tx.BitRateSwitch       = FDCAN_BRS_OFF;
    tx.FDFormat            = FDCAN_CLASSIC_CAN;
    tx.TxEventFifoControl  = FDCAN_NO_TX_EVENTS;
    tx.MessageMarker       = 0;

    /* Count every outgoing CAN frame for live-data telemetry. If the
     * HAL call fails the frame isn't actually on the wire — but we
     * still count the attempt; the host sees the attempt rate. */
    bl_live_frame_tx();

    (void)HAL_FDCAN_AddMessageToTxFifoQ(&hfdcan2, &tx, (uint8_t *)data);
}

/* Send a logical message to `dst`. If the payload fits in a single
 * frame (<= 7 bytes) one SF frame is emitted; otherwise an FF followed
 * by CFs. FC-based flow control on the sender side is not implemented
 * yet — the bootloader emits back-to-back CFs and trusts the host's
 * permissive CTS. */
static void send_message(bl_proto_type_t type,
                         uint8_t dst,
                         const uint8_t *payload,
                         uint16_t length)
{
    bl_isotp_tx_t tx;
    uint8_t       frame[8];
    uint8_t       dlc;

    bl_isotp_tx_init(&tx, payload, length);
    while (bl_isotp_tx_next(&tx, frame, &dlc)) {
        /* SF and FF keep the original message TYPE; CFs and FCs go
         * out with TYPE = DATA per the spec. */
        uint8_t pci_hi     = frame[0] & BL_ISOTP_PCI_MASK_HI;
        uint8_t frame_type = (pci_hi == BL_ISOTP_PCI_SF || pci_hi == BL_ISOTP_PCI_FF)
                                ? (uint8_t)type
                                : (uint8_t)BL_PROTO_TYPE_DATA;
        send_raw(frame_type, dst, frame, dlc);
    }
}

/* Send a positive ack. `payload[0]` is the opcode being acked;
 * `payload[1..length-1]` is opcode-specific response data. Re-arms
 * the session watchdog so long blocking handlers (FLASH_ERASE) don't
 * appear dead the instant they finally ACK. */
static void send_ack(uint8_t dst, const uint8_t *payload, uint16_t length)
{
    send_message(BL_PROTO_TYPE_ACK, dst, payload, length);
    session_touch_activity();
}

/* Send a 2-byte NACK payload wrapped in an ISO-TP SF. */
static void send_nack(uint8_t dst, uint8_t rejected_opcode, uint8_t code)
{
    uint8_t payload[2] = { rejected_opcode, code };
    bl_live_nack_sent();
    send_message(BL_PROTO_TYPE_NACK, dst, payload, (uint16_t)sizeof(payload));
}

