isc-fs/stm32-can-bootloader/Core/Src/bl_proto.c
    uint8_t resp[1] = { BL_CMD_FLASH_VERIFY };
    send_ack(peer, resp, (uint16_t)sizeof(resp));
}

/* CMD_JUMP: [addr_le32]. Phase-2 policy: the address must equal
 * BL_APP_BASE, and the installed app must pass the integrity check.
 * Host tools with a use for jumping elsewhere will land that in a
 * later phase. */
static void handle_jump(uint8_t peer, const uint8_t *args, uint16_t args_len)
{
    if (args_len < 4U) {
        send_nack(peer, BL_CMD_JUMP, BL_NACK_UNSUPPORTED);
        return;
    }

    uint32_t addr = (uint32_t)args[0]
                  | ((uint32_t)args[1] << 8)
                  | ((uint32_t)args[2] << 16)
                  | ((uint32_t)args[3] << 24);

    if (addr != BL_APP_BASE) {
        send_nack(peer, BL_CMD_JUMP, BL_NACK_OUT_OF_BOUNDS);
        return;
    }

    if (Bootloader_CheckApplication() != 0U) {
        send_nack(peer, BL_CMD_JUMP, BL_NACK_NO_VALID_APP);
        return;
    }

    uint8_t resp[1] = { BL_CMD_JUMP };
    send_ack(peer, resp, (uint16_t)sizeof(resp));

    /* Let the ACK drain onto the wire before we deinit peripherals. */
    HAL_Delay(10U);
    Bootloader_JumpToApplication();  /* never returns on success */
}

/* Dispatch a completed ISO-TP message. byte 0 = opcode, remaining bytes
 * = opcode-specific args. Anything unknown earns NACK(UNSUPPORTED). */
static void handle_message(uint8_t peer,
                           uint8_t opcode,
                           const uint8_t *args,
                           uint16_t args_len)
{
    bl_live_note_opcode(opcode);

    switch (opcode) {
        case BL_CMD_CONNECT:
            handle_connect(peer, args, args_len);
            break;
        case BL_CMD_DISCONNECT:
            handle_disconnect(peer, args_len);
            break;
        case BL_CMD_DISCOVER:
            handle_discover(peer);
            break;
        case BL_CMD_GET_FW_INFO:
            handle_get_fw_info(peer);
            break;
        case BL_CMD_GET_HEALTH:
            handle_get_health(peer);
            break;
        case BL_CMD_FLASH_ERASE:
            handle_flash_erase(peer, args, args_len);
            break;
        case BL_CMD_FLASH_WRITE:
            handle_flash_write(peer, args, args_len);
            break;
        case BL_CMD_FLASH_READ_CRC:
            handle_flash_read_crc(peer, args, args_len);
            break;
        case BL_CMD_FLASH_VERIFY:
            handle_flash_verify(peer, args, args_len);
            break;
        case BL_CMD_LOG_STREAM_START:
            handle_log_stream_start(peer, args, args_len);
            break;
        case BL_CMD_LOG_STREAM_STOP:
            handle_log_stream_stop(peer);
            break;
        case BL_CMD_LIVE_DATA_START:
            handle_live_data_start(peer, args, args_len);
            break;
        case BL_CMD_LIVE_DATA_STOP:
            handle_live_data_stop(peer);
            break;
        case BL_CMD_DTC_READ:
            handle_dtc_read(peer);
            break;
        case BL_CMD_DTC_CLEAR:
            handle_dtc_clear(peer);
            break;
        case BL_CMD_RESET:
            handle_reset(peer, args, args_len);
            break;
        case BL_CMD_JUMP:
            handle_jump(peer, args, args_len);
            break;
        default:
            send_nack(peer, opcode, BL_NACK_UNSUPPORTED);
            break;
    }
}

/* ---- Public API ---- */

void bl_proto_dispatch(const bl_proto_id_t *id,
                       const uint8_t *data,
                       uint8_t length)
{
    if (!bl_proto_addressed_to_us(id->dst) || length == 0U) {
        return;
    }

    /* Accepted TYPE/PCI combinations:
     *   - CMD      + SF / FF : host command (single or multi-frame)
     *   - DISCOVER + SF / FF : broadcast identity request
     *   - DATA     + CF / FC : continuation / flow control
     * Everything else is silently dropped. */
    uint8_t pci_hi = data[0] & BL_ISOTP_PCI_MASK_HI;
    bool initial = (id->type == BL_PROTO_TYPE_CMD || id->type == BL_PROTO_TYPE_DISCOVER)
                 && (pci_hi == BL_ISOTP_PCI_SF || pci_hi == BL_ISOTP_PCI_FF);
    bool continuation = (id->type == BL_PROTO_TYPE_DATA)
                     && (pci_hi == BL_ISOTP_PCI_CF || pci_hi == BL_ISOTP_PCI_FC);
    if (!initial && !continuation) {
        return;
    }

    /* Any frame that made it through the TYPE/PCI gate counts as session
     * activity — including frames that end up getting NACKed. A host
     * that's still transmitting, even unsuccessfully, is still alive. */
    session_touch_activity();
    bl_live_frame_rx();

    bool                 send_fc = false;
    bl_isotp_rx_status_t st      = bl_isotp_rx_feed(&g_rx,
                                                     (uint8_t)id->type,
                                                     id->src,
                                                     data,
                                                     length,
                                                     &send_fc);

    if (send_fc) {
        /* Arm the reassembly deadline at the same instant we tell the
         * host it may proceed with CFs. */
        g_rx.deadline_ms = HAL_GetTick() + BL_ISOTP_TIMEOUT_MS;
        send_fc_cts(id->src);
    }

    switch (st) {
        case BL_ISOTP_MSG_COMPLETE:
            if (g_rx.received >= 1U) {
                handle_message(id->src,
                               g_rx.buf[0],
                               &g_rx.buf[1],
                               (uint16_t)(g_rx.received - 1U));
            } else {
                send_nack(id->src, 0xFFU, BL_NACK_TRANSPORT_ERROR);
            }
            bl_isotp_rx_init(&g_rx);
            break;

        case BL_ISOTP_OK:
            break;

        case BL_ISOTP_ERR_TIMEOUT:
            /* Only _tick returns this; _feed never does. Handle
             * defensively anyway. */
            send_nack(id->src, 0xFFU, BL_NACK_TRANSPORT_TIMEOUT);
            bl_isotp_rx_init(&g_rx);
            break;

        default:
            send_nack(id->src, 0xFFU, BL_NACK_TRANSPORT_ERROR);
            bl_isotp_rx_init(&g_rx);
            break;
    }
}

void bl_proto_tick(uint32_t now_ms)
{
    uint8_t peer = 0U;
    if (bl_isotp_rx_tick(&g_rx, now_ms, &peer)) {
        send_nack(peer, 0xFFU, BL_NACK_TRANSPORT_TIMEOUT);
    }

    /* Session watchdog — only runs while a session is active. Unsigned
     * subtraction wraps around the 32-bit HAL_GetTick roll-over
     * correctly: it measures elapsed milliseconds since the last
     * activity, not an absolute deadline. */
    if (g_session_active) {
        uint32_t elapsed = now_ms - g_session_last_activity_ms;
        if (elapsed >= BL_SESSION_TIMEOUT_MS) {
            session_timeout();
        }
    }
}

bool bl_proto_session_active(void)
{
    return g_session_active;
}

void bl_proto_send_notify(const uint8_t *payload, uint16_t length)
{
    /* NOTIFY always goes to the host (node 0x0). Unsolicited — does
     * not refresh the session watchdog. */
    send_message(BL_PROTO_TYPE_NOTIFY, BL_PROTO_NODE_HOST, payload, length);
}

uint32_t bl_proto_session_age_ms(uint32_t now_ms)
{
    if (!g_session_active) {
        return 0U;
    }
    return now_ms - g_session_last_activity_ms;
}

uint16_t bl_proto_isotp_rx_progress(void)
{
    return (g_rx.state == BL_ISOTP_STATE_WAIT_CF) ? (uint16_t)g_rx.received : 0U;
}
